10/data/attachments/10f4620bc7f2e63a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Edward_today_Actions_86540_1</nif:username>
            <nif:friendToBeRequested>soap_actions_d5a9c198-a2c1-4b20-afbb-b427d7cda18d</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>